---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarTooShortMetric
source: html/ab164bf1-9785-fdd5-225e-cc5d431019b2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarTooShortMetric Property

The minimum length of rebar shape is 25 mm.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarTooShortMetric { get; }
```